app/views/search/search.html.erb

SELECT DISTINCT "measurements"."weight" FROM "measurements"
---
      Weight:
      <%= select_tag "weight", options_for_select( Measurement.uniq.pluck(:weight), params[:weight]), :include_blank => true %> lbs