app/views/search/search.html.erb

    <p>
      (test) Merchant: <%= select_tag "merchant", options_for_select( Product.all.map {|p| [p.merchant]} , params[:color]), :include_blank => true %>
---
SELECT DISTINCT "products"."merchant" FROM "products"

    <p>
      Color: <%= select_tag "color", options_for_select( Measurement.uniq.pluck(:color) , params[:color]), :include_blank => true %>
---
SELECT DISTINCT "measurements"."color" FROM "measurements"