app/views/measurements/_form.html.erb

    <%= f.label :product_id %><br />
    <% all_products = Product.all %>
---
SELECT "products".* FROM "products"