app/controllers/measurements_controller.rb

SELECT "measurements".* FROM "measurements" WHERE (color LIKE '%Gladiator%' AND gender LIKE '%Male%' AND inseam LIKE '%29%' AND waist LIKE '%28%' AND hips LIKE '%%' AND height LIKE '%%' AND weight LIKE '%%')
---
  def index
    @measurements = Measurement.search(params[:color],params[:gender],params[:inseam],params[:waist],params[:hip],params[:height],params[:weight])

SELECT "measurements".* FROM "measurements" WHERE "measurements"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @measurement = Measurement.find(params[:id])

SELECT "measurements".* FROM "measurements" WHERE "measurements"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @measurement = Measurement.find(params[:id])

INSERT INTO "measurements" ("color", "created_at", "gender", "height_feet", "height_inch", "hips", "image", "inseam", "product_id", "updated_at", "waist", "weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @measurement = Measurement.new(params[:measurement])

    respond_to do |format|
      if @measurement.save

SELECT "measurements".* FROM "measurements" WHERE "measurements"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "measurements" SET "height_feet" = 5, "height_inch" = 8, "height_feet2" = 6, "height_inch2" = 0, "weight" = 160, "weight2" = 165, "updated_at" = '2013-11-14 21:31:31.089767' WHERE "measurements"."id" = 3
---
  def update
    @measurement = Measurement.find(params[:id])

    respond_to do |format|
      if @measurement.update_attributes(params[:measurement])

SELECT "measurements".* FROM "measurements" WHERE "measurements"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "measurements" WHERE "measurements"."id" = ?  [["id", 1]]
---
  def destroy
    @measurement = Measurement.find(params[:id])
    @measurement.destroy