app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "merchant", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 14 Nov 2013 04:12:27 UTC +00:00], ["merchant", "Levi's"], ["name", "501® Strong"], ["price", 98.0], ["updated_at", Thu, 14 Nov 2013 04:12:27 UTC +00:00]]

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "products" SET "name" = '501® Original Fit Jeans', "style" = 'Original', "updated_at" = '2013-11-06 03:55:29.384350' WHERE "products"."id" = 2