app/controllers/search_controller.rb

  def search
    #store all the parameters that match the search
    @merchant = Product.where("merchant LIKE ? ", "%#{params[:merchant]}%")
    @colors = Measurement.where("color LIKE ? ", "%#{params[:color]}%")
    @genders = Measurement.where("gender LIKE ? ", params[:gender])
---
SELECT "measurements".* FROM "measurements" WHERE "measurements"."color" = 'Female'
SELECT "measurements".* FROM "measurements" WHERE "measurements"."gender" = 'gender' LIMIT 1