app/views/products/index.html.erb

    <td><%= product.style %></td>
    <td><%= product.measurements.count %></td>
---
SELECT COUNT(*) FROM "measurements" WHERE "measurements"."product_id" = 1